alexandergrib/ESP32_temp_and_Humidity_monitor/satellite/satellite.ino
#include <Arduino.h>
#include <WiFi.h>
#include <Wire.h>
#include <esp_now.h>
#include <esp_wifi.h>
#include <Preferences.h>
#include <SHT85.h>
#include <Update.h>
#include "protocol.h"

using namespace proto;

static constexpr uint32_t SERIAL_BAUD = 460800;

// Adjust for your ESP32 board if needed.
static constexpr uint8_t PIN_I2C_SDA = 21;
static constexpr uint8_t PIN_I2C_SCL = 22;
static constexpr char DEFAULT_NODE_NAME[] = "satellite";
static constexpr uint8_t FW_VERSION_MAJOR = 2;
static constexpr uint8_t FW_VERSION_MINOR = 5;
static constexpr uint32_t SATELLITE_CPU_FREQ_MHZ = 80;

#ifndef LED_BUILTIN
static constexpr uint8_t STATUS_LED_PIN = 2;
#else
static constexpr uint8_t STATUS_LED_PIN = LED_BUILTIN;
#endif

static constexpr uint32_t STATUS_LED_ON_MS = 80;
static constexpr uint32_t STATUS_LED_UNBOUND_PERIOD_MS = 1800;
static constexpr uint32_t STATUS_LED_OTA_PERIOD_MS = 160;
static constexpr uint32_t STATUS_LED_ACTIVITY_MS = 140;
static constexpr uint32_t SENSOR_CHUNK_US = 10000;
static constexpr uint32_t SENSOR_MIN_SAMPLE_PERIOD_US = 6000;
static constexpr uint32_t SENSOR_MAX_SAMPLE_PERIOD_US = 12000;
static constexpr uint32_t SENSOR_MIN_SETTLE_US = 5500;
static constexpr uint32_t SENSOR_RETRY_INTERVAL_US = 250000;
static constexpr uint32_t SENSOR_REQUEST_TIMEOUT_US = 50000;
static constexpr uint32_t SENSOR_I2C_CLOCK_HZ = 400000;
static constexpr uint32_t SENSOR_LAST_GOOD_MAX_AGE_US = 1000000;
static constexpr uint32_t SENSOR_EMPTY_CHUNK_FILL_MAX_AGE_US = 25000;
static constexpr uint32_t SENSOR_ADAPTIVE_BACKOFF_STEP_US = 1000;
static constexpr uint32_t SENSOR_ADAPTIVE_RECOVERY_STEP_US = 500;
static constexpr uint8_t SENSOR_ADAPTIVE_RECOVERY_GOOD_SAMPLES = 8;
static constexpr float SENSOR_MIN_VALID_TEMP_C = -40.0f;
static constexpr float SENSOR_MAX_VALID_TEMP_C = 125.0f;
static constexpr float SENSOR_MIN_VALID_HUMIDITY_PCT = 0.0f;
static constexpr float SENSOR_MAX_VALID_HUMIDITY_PCT = 100.0f;
static constexpr uint32_t READING_BURST_MS = 180;
static constexpr uint32_t READING_ACK_TIMEOUT_MS = 250;
static constexpr uint32_t READING_RETRY_BACKOFF_MS = 150;
static constexpr uint8_t READING_MAX_RETRIES = 3;
static constexpr uint32_t CONTROLLER_AWAKE_WINDOW_MS = 5000;
static constexpr uint32_t UNBOUND_SLEEP_MS = 250;
static constexpr size_t READING_BUFFER_CAPACITY = 8;

Preferences prefs;
SHT85 sht(SHT_DEFAULT_ADDRESS);

uint8_t controllerMac[6] = {0};
bool isBound = false;
uint32_t nodeId = 0;
uint32_t reportIntervalMs = DEFAULT_REPORT_MS;
uint16_t sampleRateHz = DEFAULT_SAMPLE_RATE_HZ;
uint32_t txSeq = 1;
char nodeName[16] = "satellite";
bool statusLedOn = false;
float tempOffsetC = 0.0f;
bool heaterEnabled = false;
bool otaReady = false;
uint32_t activityLedUntilMs = 0;

bool sensorPresent = false;
float lastTempC = NAN;
float lastHumidity = NAN;
uint32_t lastGoodSampleAtUs = 0;
bool otaRebootPending = false;
uint32_t otaRebootAtMs = 0;
uint32_t nextReportDueAtMs = 0;
uint32_t controllerAwakeUntilMs = 0;
uint32_t lastControllerContactAtMs = 0;
uint32_t lastRecoveryBindAttemptAtMs = 0;

struct SatelliteOtaState {
    bool active = false;
    uint32_t totalSize = 0;
    uint32_t expectedCrc32 = 0;
    uint32_t bytesWritten = 0;
    uint32_t runningCrc32 = 0xFFFFFFFF;
    uint32_t lastChunkOffset = 0;
    uint16_t lastChunkLen = 0;
} otaState;

struct SensorSamplerState {
    bool requestInFlight = false;
    uint32_t requestIssuedAtUs = 0;
    uint32_t nextRequestAtUs = 0;
    uint32_t chunkStartedAtUs = 0;
    uint32_t effectiveSamplePeriodUs = SENSOR_MIN_SAMPLE_PERIOD_US;
    uint8_t consecutiveGoodSamples = 0;
    uint8_t consecutiveBadSamples = 0;
    float chunkTempSum = 0.0f;
    float chunkHumiditySum = 0.0f;
    uint16_t chunkSampleCount = 0;
    float bufferedChunkTempSum = 0.0f;
    float bufferedChunkHumiditySum = 0.0f;
    uint32_t bufferedChunkCount = 0;
} sensorSampler;

struct BufferedReading {
    bool used = false;
    uint32_t sequence = 0;
    uint32_t sampledAtMs = 0;
    uint32_t lastSendAtMs = 0;
    uint8_t retryCount = 0;
    float temperatureC = NAN;
    float humidityPct = NAN;
    uint8_t sensorOk = 0;
};

BufferedReading readingBuffer[READING_BUFFER_CAPACITY];
size_t readingBufferHead = 0;
size_t readingBufferCount = 0;

void handleIncomingPacket(const uint8_t* data, int len);
void logSendStatus(esp_now_send_status_t status);
void pumpSensorSampling();
void maintainControllerLink();

void noteActivity() {
    activityLedUntilMs = millis() + STATUS_LED_ACTIVITY_MS;
}

void stayAwakeForController(uint32_t durationMs = CONTROLLER_AWAKE_WINDOW_MS) {
    const uint32_t deadlineMs = millis() + durationMs;
    controllerAwakeUntilMs = controllerAwakeUntilMs > deadlineMs ? controllerAwakeUntilMs : deadlineMs;
}

bool timeReachedUs(uint32_t now, uint32_t target) {
    return static_cast<int32_t>(now - target) >= 0;
}

bool timeReachedMs(uint32_t now, uint32_t target) {
    return static_cast<int32_t>(now - target) >= 0;
}

String sanitizeNodeName(String name) {
    name.trim();
    String sanitized;
    sanitized.reserve(15);
    for (size_t i = 0; i < name.length() && sanitized.length() < 15; ++i) {
        const char c = name[i];
        if ((c >= 'A' && c <= 'Z') ||
            (c >= 'a' && c <= 'z') ||
            (c >= '0' && c <= '9') ||
            c == '_' || c == '-' || c == ' ') {
            sanitized += c;
        }
    }
    sanitized.trim();
    if (sanitized.length() == 0) sanitized = DEFAULT_NODE_NAME;
    return sanitized;
}

void applySensorConfig() {
    sht.setTemperatureOffset(tempOffsetC);
    if (heaterEnabled) {
        sht.heatOn();
    } else {
        sht.heatOff();
    }
}

void initStatusLed() {
    pinMode(STATUS_LED_PIN, OUTPUT);
    digitalWrite(STATUS_LED_PIN, LOW);
}

void updateStatusLed() {
    const uint32_t now = millis();
    bool ledHigh = false;

    if (otaRebootPending) {
        ledHigh = true;
    } else if (otaState.active) {
        ledHigh = ((now / STATUS_LED_OTA_PERIOD_MS) % 2U) == 0U;
    } else if (static_cast<int32_t>(activityLedUntilMs - now) > 0) {
        ledHigh = true;
    } else if (!isBound) {
        const uint32_t phase = now % STATUS_LED_UNBOUND_PERIOD_MS;
        ledHigh = phase < STATUS_LED_ON_MS || (phase >= 220 && phase < 220 + STATUS_LED_ON_MS);
    } else {
        ledHigh = false;
    }

    if (ledHigh != statusLedOn) {
        statusLedOn = ledHigh;
        digitalWrite(STATUS_LED_PIN, ledHigh ? HIGH : LOW);
    }
}

bool macIsZero(const uint8_t* mac) {
    for (int i = 0; i < 6; ++i) if (mac[i] != 0) return false;
    return true;
}

