alexandergrib/ESP32_temp_and_Humidity_monitor/satellite/satellite.ino
uint32_t normalizeReportInterval(uint32_t ms) {
    return max(ms, MIN_REPORT_MS);
}

uint16_t normalizeSampleRateHz(uint32_t hz) {
    return static_cast<uint16_t>(constrain(hz, MIN_SAMPLE_RATE_HZ, MAX_SAMPLE_RATE_HZ));
}

uint32_t requestedSamplePeriodUs() {
    return max<uint32_t>(1000000UL / normalizeSampleRateHz(sampleRateHz), SENSOR_MIN_SAMPLE_PERIOD_US);
}

uint32_t samplePeriodUs() {
    return constrain(
        max(sensorSampler.effectiveSamplePeriodUs, requestedSamplePeriodUs()),
        requestedSamplePeriodUs(),
        SENSOR_MAX_SAMPLE_PERIOD_US
    );
}

bool isValidSensorSample(float temperatureC, float humidityPct) {
    return isfinite(temperatureC) &&
           isfinite(humidityPct) &&
           temperatureC >= SENSOR_MIN_VALID_TEMP_C &&
           temperatureC <= SENSOR_MAX_VALID_TEMP_C &&
           humidityPct >= SENSOR_MIN_VALID_HUMIDITY_PCT &&
           humidityPct <= SENSOR_MAX_VALID_HUMIDITY_PCT;
}

bool hasRecentGoodSample(uint32_t nowUs) {
    return lastGoodSampleAtUs != 0 &&
           timeReachedUs(nowUs, lastGoodSampleAtUs) &&
           (nowUs - lastGoodSampleAtUs) <= SENSOR_LAST_GOOD_MAX_AGE_US &&
           isValidSensorSample(lastTempC, lastHumidity);
}

bool canReuseLastSampleForChunk(uint32_t nowUs) {
    return hasRecentGoodSample(nowUs) &&
           (nowUs - lastGoodSampleAtUs) <= max(SENSOR_EMPTY_CHUNK_FILL_MAX_AGE_US, samplePeriodUs() * 2U);
}

void clearBufferedChunks() {
    sensorSampler.bufferedChunkTempSum = 0.0f;
    sensorSampler.bufferedChunkHumiditySum = 0.0f;
    sensorSampler.bufferedChunkCount = 0;
}

void resetCurrentChunk() {
    sensorSampler.chunkTempSum = 0.0f;
    sensorSampler.chunkHumiditySum = 0.0f;
    sensorSampler.chunkSampleCount = 0;
}

void restartSensorSampler(bool clearHistory = false) {
    const uint32_t nowUs = micros();
    sensorSampler.requestInFlight = false;
    sensorSampler.requestIssuedAtUs = 0;
    sensorSampler.nextRequestAtUs = nowUs;
    sensorSampler.chunkStartedAtUs = nowUs;
    sensorSampler.effectiveSamplePeriodUs = requestedSamplePeriodUs();
    sensorSampler.consecutiveGoodSamples = 0;
    sensorSampler.consecutiveBadSamples = 0;
    resetCurrentChunk();
    if (clearHistory) {
        clearBufferedChunks();
        lastTempC = NAN;
        lastHumidity = NAN;
        lastGoodSampleAtUs = 0;
    }
}

void noteSamplingFailure() {
    sensorSampler.consecutiveBadSamples = min<uint8_t>(sensorSampler.consecutiveBadSamples + 1, 32);
    sensorSampler.consecutiveGoodSamples = 0;
    const uint32_t backoffStepUs = SENSOR_ADAPTIVE_BACKOFF_STEP_US *
                                   min<uint8_t>(sensorSampler.consecutiveBadSamples, 4);
    sensorSampler.effectiveSamplePeriodUs = min(
        SENSOR_MAX_SAMPLE_PERIOD_US,
        max(sensorSampler.effectiveSamplePeriodUs, requestedSamplePeriodUs()) + backoffStepUs
    );
}

void noteSamplingSuccess() {
    sensorSampler.consecutiveBadSamples = 0;
    sensorSampler.consecutiveGoodSamples = min<uint8_t>(sensorSampler.consecutiveGoodSamples + 1, 32);
    const uint32_t targetPeriodUs = requestedSamplePeriodUs();
    if (sensorSampler.effectiveSamplePeriodUs > targetPeriodUs &&
        sensorSampler.consecutiveGoodSamples >= SENSOR_ADAPTIVE_RECOVERY_GOOD_SAMPLES) {
        sensorSampler.effectiveSamplePeriodUs = max(
            targetPeriodUs,
            sensorSampler.effectiveSamplePeriodUs - SENSOR_ADAPTIVE_RECOVERY_STEP_US
        );
        sensorSampler.consecutiveGoodSamples = 0;
    }
}

void finalizeCurrentChunk() {
    if (sensorSampler.chunkSampleCount > 0) {
        sensorSampler.bufferedChunkTempSum += sensorSampler.chunkTempSum / sensorSampler.chunkSampleCount;
        sensorSampler.bufferedChunkHumiditySum += sensorSampler.chunkHumiditySum / sensorSampler.chunkSampleCount;
        sensorSampler.bufferedChunkCount++;
    } else if (canReuseLastSampleForChunk(sensorSampler.chunkStartedAtUs + SENSOR_CHUNK_US)) {
        sensorSampler.bufferedChunkTempSum += lastTempC;
        sensorSampler.bufferedChunkHumiditySum += lastHumidity;
        sensorSampler.bufferedChunkCount++;
    }
    resetCurrentChunk();
}

void rollChunkWindows(uint32_t nowUs) {
    if (sensorSampler.chunkStartedAtUs == 0) {
        sensorSampler.chunkStartedAtUs = nowUs;
    }

    while (timeReachedUs(nowUs, sensorSampler.chunkStartedAtUs + SENSOR_CHUNK_US)) {
        finalizeCurrentChunk();
        sensorSampler.chunkStartedAtUs += SENSOR_CHUNK_US;
    }
}

void recordSensorSample(float temperatureC, float humidityPct) {
    if (!isValidSensorSample(temperatureC, humidityPct)) {
        return;
    }
    lastTempC = temperatureC;
    lastHumidity = humidityPct;
    lastGoodSampleAtUs = micros();
    sensorSampler.chunkTempSum += temperatureC;
    sensorSampler.chunkHumiditySum += humidityPct;
    sensorSampler.chunkSampleCount++;
}

bool prepareReadingSnapshot(float& temperatureC, float& humidityPct, bool& sensorOk) {
    const uint32_t nowUs = micros();
    rollChunkWindows(nowUs);

    if (sensorSampler.bufferedChunkCount > 0) {
        const float bufferedTemperatureC = sensorSampler.bufferedChunkTempSum / sensorSampler.bufferedChunkCount;
        const float bufferedHumidityPct = sensorSampler.bufferedChunkHumiditySum / sensorSampler.bufferedChunkCount;
        if (isValidSensorSample(bufferedTemperatureC, bufferedHumidityPct)) {
            temperatureC = bufferedTemperatureC;
            humidityPct = bufferedHumidityPct;
            sensorOk = true;
            return true;
        }
    }

    if (hasRecentGoodSample(nowUs)) {
        temperatureC = lastTempC;
        humidityPct = lastHumidity;
        sensorOk = true;
        return true;
    }

    temperatureC = NAN;
    humidityPct = NAN;
    sensorOk = false;
    return false;
}

BufferedReading* oldestBufferedReading() {
    if (readingBufferCount == 0) {
        return nullptr;
    }
    return &readingBuffer[readingBufferHead];
}

void dropOldestBufferedReading() {
    if (readingBufferCount == 0) {
        return;
    }
    readingBuffer[readingBufferHead] = BufferedReading{};
    readingBufferHead = (readingBufferHead + 1U) % READING_BUFFER_CAPACITY;
    readingBufferCount--;
}

